# category_des.py
class CategoryDescription:
    # 문자 생성 전용 카테고리 세부 설명
    CATEGORY_DESCRIPTIONS_TEXT = {
    "재난/경고성 문자": "재난 상황이나 경고성 문자, 또는 주기적인 사내 대피 안내 문자",
    "광고/홍보 문자": "기업의 제품이나 서비스 홍보를 위한 문자",
    "정당 선거 문자": "일반적인 홍보 포스터 형식의 선거 홍보 문자",
    "일반 안내 문자": "보편적인 형식으로 행사 안내 또는 공지사항 용도 문자",
    "증권 관련 문자": "주식 시장 정보나 금융 뉴스 관련 문자",
    "실종자 안내 문자": "성함, 나이, 키, 인상착의, 거주지 등를 포함한 문자",
    "명함 문자": "이름, 직급, 소속 등을 포함한 문자",
    "부고 정보": "고인의 이름, 장례식장 위치 등을 포함한 문자",
    "건강 정보": "건강에 대한 문자"
    }

    # 이미지 생성 전용 카테고리 세부 설명
    CATEGORY_DESCRIPTIONS_IMAGE = {
    "재난/경고성 문자": "경고성 이미지나 사내 대피 안내 지침 이미지를 함께 전송",
    "광고/홍보 문자": "서비스 홍보를 위한 이미지를 만들기, 시각적으로 홍보 효과를 주기.",
    "정당 선거 문자": "AI는 일반적인 홍보 포스터를 생성",
    "일반 안내 문자": "단순하고 임팩트있는 기본 안내 이미지",
    "증권 관련 문자": "그래프나 차트가 있는 이미지",
    "실종자 안내 문자": "실종자의 묘사인 얼굴 및 인상착의를 이미지로 생성",
    "명함 문자": "디지털 명함 형식으로 이미지를 생성",
    "부고 정보": "장례식 등 고인의 부고를 알리는 이미지",
    "건강 정보": "건강과 관련된 이미지"
    }